EnryGentile/Embedded-Secure-Gate-Controller/src/Remote_Controller/x-cube-subg1_firmware/STM32CubeExpansion_SUBG1_V3.3.0/Projects/STM32F401RE-NUCLEO/Examples/SPIRIT1/P2P_demo/Src/radio_appli.c
PktBasicInit xBasicInit={
  
  PREAMBLE_LENGTH,
  SYNC_LENGTH,
  SYNC_WORD,
#if defined(X_NUCLEO_IDS01A4) || defined(X_NUCLEO_IDS01A5)
  LENGTH_TYPE,
  LENGTH_WIDTH,
#endif
#if defined(X_NUCLEO_S2868A1) || defined(X_NUCLEO_S2915A1)
  VARIABLE_LENGTH,
  EXTENDED_LENGTH_FIELD,
#endif
  CRC_MODE,
#if defined(X_NUCLEO_IDS01A4) || defined(X_NUCLEO_IDS01A5)
  CONTROL_LENGTH,
#endif
  EN_ADDRESS,
  EN_FEC,
  EN_WHITENING
};

/**
* @brief Address structure fitting
*/
PktBasicAddressesInit xAddressInit={
  EN_FILT_MY_ADDRESS,
  MY_ADDRESS,
  EN_FILT_MULTICAST_ADDRESS,
  MULTICAST_ADDRESS,
  EN_FILT_BROADCAST_ADDRESS,
  BROADCAST_ADDRESS
};

#endif

#ifdef CSMA_ENABLE
/**
* @brief CSMA structure fitting
*/
RadioCsmaInit xCsmaInit={
  
  PERSISTENT_MODE_EN, /* CCA may optionally be persistent, i.e., rather than 
  entering backoff when the channel is found busy, CCA continues until the 
  channel becomes idle or until the MCU stops it.
  The thinking behind using this option is to give the MCU the possibility of 
  managing the CCA by itself, for instance, with the allocation of a 
  transmission timer: this timer would start when MCU finishes sending out 
  data to be transmitted, and would end when MCU expects that its transmission
  takes place, which would occur after a period of CCA.
  The choice of making CCA persistent should come from trading off 
  transmission latency,under the direct control of the MCU, and power 
  consumption, which would be greater due to a busy wait in reception mode.
  */
  CS_PERIOD,
  CS_TIMEOUT,
  MAX_NB,
  BU_COUNTER_SEED,
  CU_PRESCALER
};
#endif 

/* Private define ------------------------------------------------------------*/
#define TIME_UP                                         0x01

/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/
RadioDriver_t *pRadioDriver;
MCULowPowerMode_t *pMCU_LPM_Comm;
RadioLowPowerMode_t  *pRadio_LPM_Comm;
/*Flags declarations*/
volatile FlagStatus xRxDoneFlag = RESET, xTxDoneFlag=RESET, cmdFlag=RESET;
volatile FlagStatus xStartRx=RESET, rx_timeout=RESET, exitTime=RESET;
volatile FlagStatus PushButtonStatusWakeup=RESET;
volatile FlagStatus PushButtonStatusData=RESET;
/*IRQ status struct declaration*/
RadioIrqs xIrqStatus;

__IO uint32_t KEYStatusData = 0x00;
static AppliFrame_t xTxFrame, xRxFrame;
#if defined(X_NUCLEO_IDS01A4) || defined(X_NUCLEO_IDS01A5)
uint8_t DestinationAddr;
#endif
uint8_t TxFrameBuff[MAX_BUFFER_LEN] = {0x00};
uint16_t exitCounter = 0;
uint16_t txCounter = 0;
uint16_t wakeupCounter = 0;
uint16_t dataSendCounter = 0x00;

/* Private function prototypes -----------------------------------------------*/

#if defined(X_NUCLEO_S2868A1) || defined(X_NUCLEO_S2915A1)

void HAL_S2LP_Init(void);
void Enter_LP_mode(void);
void Exit_LP_mode(void);
void MCU_Enter_StopMode(void);
void MCU_Enter_StandbyMode(void);
void MCU_Enter_SleepMode(void);
void RadioPowerON(void);
void RadioPowerOFF(void);
void RadioStandBy(void);
void RadioSleep(void);
void AppliSendBuff(AppliFrame_t *xTxFrame, uint8_t cTxlen);
void AppliReceiveBuff(uint8_t *RxFrameBuff, uint8_t cRxlen);
void P2P_Init(void);
void STackProtocolInit(void);
void BasicProtocolInit(void);
void P2PInterruptHandler(void);
void Set_KeyStatus(FlagStatus val);
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin);
void HAL_SYSTICK_Callback(void);
#endif

/* Private functions ---------------------------------------------------------*/

/** @defgroup S2LP_APPLI_Private_Functions
* @{
*/

/**
* @brief  Initializes RF Transceiver's HAL.
* @param  None
* @retval None.
*/

uint32_t Init_Counter_From_Flash(void) {
    uint32_t last_saved_value = 0;
    uint32_t *flash_ptr = (uint32_t *)FLASH_USER_START_ADDR;

    while (flash_ptr < (uint32_t *)FLASH_USER_END_ADDR) {
        if (*flash_ptr == 0xFFFFFFFF) {
            break;
        }
        last_saved_value = *flash_ptr;
        flash_ptr++;
    }

    if (last_saved_value > 0) {
        return last_saved_value + 15;
    }

    return 0;
}

void Save_Counter_To_Flash(uint32_t current_counter) {
    uint32_t *flash_ptr = (uint32_t *)FLASH_USER_START_ADDR;
    uint32_t write_addr = FLASH_USER_START_ADDR;

    while (flash_ptr < (uint32_t *)FLASH_USER_END_ADDR) {
        if (*flash_ptr == 0xFFFFFFFF) {
            break;
        }
        flash_ptr++;
        write_addr += 4;
    }

    HAL_FLASH_Unlock();

    if (write_addr >= FLASH_USER_END_ADDR) {
        FLASH_EraseInitTypeDef EraseInitStruct;
        uint32_t SectorError;

        EraseInitStruct.TypeErase = FLASH_TYPEERASE_SECTORS;
        EraseInitStruct.VoltageRange = FLASH_VOLTAGE_RANGE_3;
        EraseInitStruct.Sector = FLASH_USER_SECTOR;
        EraseInitStruct.NbSectors = 1;

        HAL_FLASHEx_Erase(&EraseInitStruct, &SectorError);

        write_addr = FLASH_USER_START_ADDR;
    }

    HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, write_addr, current_counter);

    HAL_FLASH_Lock();
}

void HAL_Radio_Init(void)
{
  pRadioDriver = &radio_cb;
#if defined(X_NUCLEO_IDS01A4) || defined(X_NUCLEO_IDS01A5)
  pRadioDriver->Init( ); 
#endif
#if defined(X_NUCLEO_S2868A1) || defined(X_NUCLEO_S2915A1)
  S2LPInterfaceInit(); 
#endif
}



SM_State_t SM_State = SM_STATE_START_RX;/* The actual state running */

/**
* @brief  S2LP P2P Process State machine
* @param  uint8_t *pTxBuff = Pointer to aTransmitBuffer 
*         uint8_t cTxlen = length of aTransmitBuffer 
*         uint8_t* pRxBuff = Pointer to aReceiveBuffer
*         uint8_t cRxlen= length of aReceiveBuffer
* @retval None.
*/
void P2P_Process(uint8_t *pTxBuff, uint8_t cTxlen, uint8_t* pRxBuff, uint8_t cRxlen)
{
  uint8_t xIndex = 0;
  uint8_t ledToggleCtr = 0;
  uint8_t  dest_addr;
  /*float rRSSIValue = 0;*/
  
  switch(SM_State)
  {
  case SM_STATE_START_RX:
    {      
      AppliReceiveBuff(pRxBuff, cRxlen);
      /* wait for data received or timeout period occured */
      SM_State = SM_STATE_WAIT_FOR_RX_DONE;    
    }
    break;
    
  case SM_STATE_WAIT_FOR_RX_DONE:
    if((RESET != xRxDoneFlag)||(RESET != rx_timeout)||(SET != exitTime))
    {
      if((rx_timeout==SET)||(exitTime==RESET))
      {
        rx_timeout = RESET;
#if defined(X_NUCLEO_IDS01A4) || defined(X_NUCLEO_IDS01A5)
        BSP_LED_Toggle(LED2);
#endif
        SM_State = SM_STATE_START_RX;
      }
      else if(xRxDoneFlag) 
      {
        xRxDoneFlag=RESET;
        SM_State = SM_STATE_DATA_RECEIVED;
      }
    }
    break;
    
  case SM_STATE_DATA_RECEIVED:
    {
#if defined(X_NUCLEO_S2868A1) || defined(X_NUCLEO_S2915A1)
      pRadioDriver = &radio_cb; 
#endif
      
      pRadioDriver->GetRxPacket(pRxBuff,&cRxlen); 
      /*rRSSIValue = Spirit1GetRssiTH();*/
      /*rRSSIValue = S2LPGetRssiTH();*/
      xRxFrame.Cmd = pRxBuff[0];
      xRxFrame.CmdLen = pRxBuff[1];
      xRxFrame.Cmdtag = pRxBuff[2];
      xRxFrame.CmdType = pRxBuff[3];
      xRxFrame.DataLen = pRxBuff[4];
      
      for (xIndex = 5; xIndex < cRxlen; xIndex++)
      {
        xRxFrame.DataBuff[xIndex] = pRxBuff[xIndex];
      }
      if(xRxFrame.Cmd == LED_TOGGLE)
      {
        SM_State = SM_STATE_TOGGLE_LED; 
      } 
      if(xRxFrame.Cmd == ACK_OK)
      {
#if defined(X_NUCLEO_IDS01A4) || defined(X_NUCLEO_IDS01A5)
        HAL_Delay(DELAY_TX_LED_GLOW); 
#endif
        SM_State = SM_STATE_ACK_RECEIVED;
      }
    }
    break;
    
