EnryGentile/Embedded-Secure-Gate-Controller/src/Remote_Controller/x-cube-subg1_firmware/STM32CubeExpansion_SUBG1_V3.3.0/Projects/STM32F401RE-NUCLEO/Examples/SPIRIT1/P2P_demo/Src/radio_appli.c
#ifdef USE_STack_LLP
  /* LLP structure fitting */
  PktStackLlpInit xStackLLPInit=
  {
    .xAutoAck = S_ENABLE,                
    .xPiggybacking = S_ENABLE,              
    .xNMaxRetx = PKT_DISABLE_RETX
  }; 
#else
  /* LLP structure fitting */
  PktStackLlpInit xStackLLPInit=
  {
    .xAutoAck = S_DISABLE,                
    .xPiggybacking = S_DISABLE,              
    .xNMaxRetx = PKT_DISABLE_RETX
  }; 
#endif
  
  Radio_PktStackLlpInit(&xStackLLPInit);
  
  PktStackAddressesInit xAddressInit=
  {
    .xFilterOnMyAddress = S_ENABLE,
    .cMyAddress = MY_ADDRESS,
    .xFilterOnMulticastAddress = S_DISABLE,
    .cMulticastAddress = MULTICAST_ADDRESS,
    .xFilterOnBroadcastAddress = S_ENABLE,
    .cBroadcastAddress = BROADCAST_ADDRESS
  };
  
  Radio_PktStackAddressesInit(&xAddressInit);
  if(EN_FILT_SOURCE_ADDRESS)
  {
    Radio_PktStackFilterOnSourceAddress(S_ENABLE);
    Radio_PktStackSetRxSourceMask(SOURCE_ADDR_MASK);
    Radio_PktStackSetSourceReferenceAddress (SOURCE_ADDR_REF);
    
    
    
  }
  else
  {
    RadioPktStackFilterOnSourceAddress(S_DISABLE);    
  }
#endif
  
  RadioPktBasicAddressesInit(&xAddressInit);
#if defined(X_NUCLEO_IDS01A4) || defined(X_NUCLEO_IDS01A5)
  pRadioDriver->DisableIrq();
#endif
#if defined(X_NUCLEO_S2868A1) || defined(X_NUCLEO_S2915A1)
  pRadioDriver = &radio_cb;  
  /* S2LP IRQs disable */
  S2LPGpioIrqDeInit(NULL);
  /* S2LP IRQs enable */
#endif
  pRadioDriver->EnableRxIrq();
  /* payload length config */
  pRadioDriver->SetPayloadLen(PAYLOAD_LEN);
  /* rx timeout config */
#if defined(X_NUCLEO_IDS01A4) || defined(X_NUCLEO_IDS01A5)
  pRadioDriver->SetRxTimeout(RECEIVE_TIMEOUT);
#endif
  
#if defined(X_NUCLEO_S2868A1) || defined(X_NUCLEO_S2915A1)
  S2LPTimerSetRxTimerMs(700.0);
  SET_INFINITE_RX_TIMEOUT();  
#endif
#if defined(X_NUCLEO_IDS01A4) || defined(X_NUCLEO_IDS01A5)
  /* destination address */
  pRadioDriver->SetDestinationAddress(DestinationAddr);  
  /* IRQ registers blanking */
  pRadioDriver->ClearIrqStatus(); 
  /* RX command */
#endif
#if defined(X_NUCLEO_S2868A1) || defined(X_NUCLEO_S2915A1)
  /* destination address */
  pRadioDriver->SetDestinationAddress(DESTINATION_ADDRESS);
  /* IRQ registers blanking */
  S2LPGpioIrqClearStatus(); 
#endif
  /* RX command */ 
  pRadioDriver->StartRx(); 
}

/**
* @brief  This function initializes the protocol for point-to-point 
* communication
* @param  None
* @retval None
*/
void P2P_Init(void)
{

	contatore = Init_Counter_From_Flash();
#if defined(X_NUCLEO_IDS01A4) || defined(X_NUCLEO_IDS01A5)
  DestinationAddr=MULTICAST_ADDRESS;
  pRadioDriver->GpioIrq(&xGpioIRQ);
  pRadioDriver->RadioInit(&xRadioInit);
  pRadioDriver->SetRadioPower(POWER_INDEX, POWER_DBM);  
#endif
#if defined(X_NUCLEO_S2868A1) || defined(X_NUCLEO_S2915A1)
  pRadioDriver = &radio_cb;
  
  /* S2LP IRQ config */
  S2LPGpioInit(&xGpioIRQ);
  
  /* S2LP Radio config */    
  S2LPRadioInit(&xRadioInit);
  
  
  /* S2LP Radio set power */
  S2LPRadioSetMaxPALevel(S_DISABLE);  
  
  if(!S2LPManagementGetRangeExtender())
  {
    /* if we haven't an external PA, use the library function */
    S2LPRadioSetPALeveldBm(POWER_INDEX,POWER_DBM);
  }
  else
  { 
    /* in case we are using the PA board, the S2LPRadioSetPALeveldBm will be not functioning because
    the output power is affected by the amplification of this external component.
    Set the raw register. */
    uint8_t paLevelValue=0x25; /* for example, this value will give 23dBm about */
    S2LPSpiWriteRegisters(PA_POWER8_ADDR, 1, &paLevelValue);
  }
  S2LPRadioSetPALevelMaxIndex(POWER_INDEX); 
#endif
  
  
  /* S2LP Packet config */  
  pRadioDriver->PacketConfig();
  
  pRadioDriver->EnableSQI();
#if defined(X_NUCLEO_IDS01A4) || defined(X_NUCLEO_IDS01A5)
  pRadioDriver->SetRssiThreshold(RSSI_THRESHOLD);
#endif
#if defined(X_NUCLEO_S2868A1) || defined(X_NUCLEO_S2915A1)
  S2LPRadioSetRssiThreshdBm(RSSI_THRESHOLD);
#endif
  
}

/**
* @brief  This function initializes the STack Packet handler of S2LP
* @param  None
* @retval None
*/
void STackProtocolInit(void)
{ 
  
  
  PktStackInit xStackInit=
  {
    .xPreambleLength = PREAMBLE_LENGTH,
    .xSyncLength = SYNC_LENGTH,
    .lSyncWords = SYNC_WORD,
#if defined(X_NUCLEO_IDS01A4) || defined(X_NUCLEO_IDS01A5)
    .xFixVarLength = LENGTH_TYPE,
    .cPktLengthWidth = 8, 
#endif   
#if defined(X_NUCLEO_S2868A1) || defined(X_NUCLEO_S2915A1)
    .xFixVarLength = S_ENABLE,
    .cExtendedPktLenField = S_DISABLE,
#endif
    .xCrcMode = CRC_MODE,
#if defined(X_NUCLEO_IDS01A4) || defined(X_NUCLEO_IDS01A5)
    .xControlLength = CONTROL_LENGTH,
#endif   
    .xFec = EN_FEC,
    .xDataWhitening = EN_WHITENING
  };  
  /* Radio Packet config */
  RadioPktStackInit (&xStackInit);
}  


/*xDataWhitening;  *
* @brief  This function initializes the BASIC Packet handler of S2LP
* @param  None
* @retval None
*/
void BasicProtocolInit(void)
{
  /* RAdio Packet config */
  RadioPktBasicInit(&xBasicInit);
}

/**
* @brief  This routine will put the radio and mcu in LPM
* @param  None
* @retval None
*/
void Enter_LP_mode(void)
{  
  pMCU_LPM_Comm = &MCU_LPM_cb;
  pRadio_LPM_Comm = &Radio_LPM_cb;
  
#if defined(MCU_SLEEP_MODE)&&defined(RF_SHUTDOWN) 
  {
    pRadio_LPM_Comm->RadioShutDown(); 
    pMCU_LPM_Comm->McuSleepMode();
  }
#elif defined(MCU_SLEEP_MODE)&&defined(RF_STANDBY) 
  {
    pRadio_LPM_Comm->RadioStandBy(); 
    pMCU_LPM_Comm->McuSleepMode();
  }
#elif defined(MCU_SLEEP_MODE)&&defined(RF_SLEEP) 
  {
    pRadio_LPM_Comm->RadioSleep();
    pMCU_LPM_Comm->McuSleepMode();
  }
#elif defined(MCU_STOP_MODE)&&defined(RF_SHUTDOWN) 
  {
    pRadio_LPM_Comm->RadioShutDown(); 
    pMCU_LPM_Comm->McuStopMode();
  }
#elif defined(MCU_STOP_MODE)&&defined(RF_STANDBY) 
  {
    pRadio_LPM_Comm->RadioStandBy(); 
    pMCU_LPM_Comm->McuStopMode();
  }
#elif defined(MCU_STOP_MODE)&&defined(RF_SLEEP) 
  {
    pRadio_LPM_Comm->RadioSleep();
    pMCU_LPM_Comm->McuStopMode();
  }
#else
  pMCU_LPM_Comm->McuSleepMode();
#endif
}

/**
* @brief  This routine wake-up the mcu and radio from LPM
* @param  None
* @retval None
*/
void Exit_LP_mode(void)
{
  pRadio_LPM_Comm = &Radio_LPM_cb;      
  pRadio_LPM_Comm->RadioPowerON();  
}

/**
* @brief  This routine puts the MCU in stop mode
* @param  None
* @retval None
*/
void MCU_Enter_StopMode(void)
{
  APPLI_EnterSTOPMode();
}

/**
* @brief  This routine puts the MCU in standby mode
* @param  None
* @retval None
*/
void MCU_Enter_StandbyMode(void)
{
  APPLI_EnterSTANDBYMode();
}

/**
* @brief  This routine puts the MCU in sleep mode
* @param  None
* @retval None
*/
void MCU_Enter_SleepMode(void)
{
  /*Suspend Tick increment to prevent wakeup by Systick interrupt. 
  Otherwise the Systick interrupt will wake up the device within 1ms (HAL time base)*/
  
